class QLESQ:
    transcript = {
        5: ('WojN', "Постоянно"),
        3: ('WojN', "Иногда"),
        4: ('WojN', "Часто"),
        2: ('WojN', "Редко"),
        1: ('WojN', "Никогда")
    }

    transcript2 = {
        5: ('WojN', "Полностью доволен"),
        4: ('WojN', "Доволен"),
        2: ('WojN', "Иногда доволен"),
        3: ('WojN', "Недоволен"),
        1: ('WojN', "Совсем  недоволен"),
        6: ('WojN', "Не принимаю лекарств")
    }

    answer_min_norma = [1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]

    answer_max_norma = [5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5]

    answer_random_norm = [1, 2, 3, 4, 2, 1, 2, 3, 4, 2, 1, 1, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2]

    answer_border_lower = [1, 2, 2, 4, 2, 1, 2, 3, 4, 2, 1, 1, 1, 2, 3, 2, 2, 2, 2, 3, 1, 1, 1]

    answer_border_higher = [1, 2, 3, 4, 2, 1, 2, 3, 4, 3, 1, 1, 2, 2, 3, 2, 2, 2, 2, 3, 2, 2, 1]

    answer_higher1 = [1, 2, 3, 4, 2, 1, 2, 3, 4, 3, 1, 1, 2, 2, 3, 2, 2, 2, 2, 3, 2, 2, 1]

    answer_higher2 = [1, 2, 3, 4, 2, 1, 2, 3, 4, 3, 1, 1, 2, 2, 2, 2, 2, 2, 2, 3, 2, 2, 1]

